Name : Paavani Ramakrishna
Git Username : paavani2000
USC id : 7696462483

In [4]:
import pandas as pd

In [5]:
filepath = "../data/Salaries.csv"

In [6]:
df = pd.read_csv(filepath)

In [7]:
df.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [9]:
df = pd.read_csv(filepath, index_col = "playerID")

In [10]:
df.head()

           yearID teamID lgID  salary
playerID
barkele01    1985    ATL   NL  870000
bedrost01    1985    ATL   NL  550000
benedbr01    1985    ATL   NL  545000
campri01     1985    ATL   NL  633333
ceronri01    1985    ATL   NL  625000

In [18]:
greater_than_1_mil = df[((df.teamID=="ATL") | (df.teamID=="HOU")) & (df.salary >= 1000000)]
print("Number of people with ALT or HOU having salary greater than 1 million:", greater_than_1_mil.shape[0])
print(greater_than_1_mil)

Number of people with ALT or HOU having salary greater than 1 million: 625
           yearID teamID lgID   salary
playerID
hornebo01    1985    ATL   NL  1500000
murphda05    1985    ATL   NL  1625000
suttebr01    1985    ATL   NL  1354167
ryanno01     1985    HOU   NL  1350000
hornebo01    1986    ATL   NL  1800000
...           ...    ...  ...      ...
rasmuco01    2015    HOU   AL  8000000
singljo02    2015    HOU   AL  2000000
sippto01     2015    HOU   AL  2400000
thatcjo01    2015    HOU   AL  1000000
valbulu01    2015    HOU   AL  4200000

[625 rows x 4 columns]

In [35]:
data_ATL = df[(df.teamID == "ATL")]
data_ATL_std = data_ATL.std(axis=0)
print("Standard deviation = ", data_ATL_std.salary)
data_ATL_mean = data_ATL.mean(axis=0)
print("mean = ", data_ATL_mean.salary)
data_ATL_max = data_ATL.max(axis=0)
print("max = ", data_ATL_max.salary)
data_ATL_quantile = data_ATL.quantile([0.25,0.5,0.75])
print("quantile = ", data_ATL_quantile.salary)
df.describe()

Standard deviation =  3432672.9832373876
mean =  2206239.316027088
max =  16061802
quantile =  0.25     300000.0
0.50     600000.0
0.75    2390625.0
Name: salary, dtype: float64

             yearID        salary
count  25575.000000  2.557500e+04
mean    2000.374389  2.008563e+06
std        8.610604  3.315706e+06
min     1985.000000  0.000000e+00
25%     1993.000000  2.750000e+05
50%     2000.000000  5.500000e+05
75%     2008.000000  2.250000e+06
max     2015.000000  3.300000e+07

In [36]:
df_frame = pd.DataFrame(df)
output_list = []
for index, row in df_frame.iterrows():
    my_dict = {index:row}
    output_list.append(my_dict)
print(output_list)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [37]:
print("")